CSI API ETABS v1
cLinkObj.GetElm Method
 Retrieves the name of the link element (analysis model link) associated with a specified link object in the object-based model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetElm(
	string Name,
	ref string Elm
)
Function GetElm (
	Name As String,
	ByRef Elm As String
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim Elm As String
Dim returnValue As Integer
returnValue = instance.GetElm(Name, Elm)
int GetElm(
	String^ Name,
	String^% Elm
)
abstract GetElm :
        Name : string *
        Elm : string byref -> int
Parameters
Name
Type: System.String
The name of an existing link object.
Elm
Type: System.String
The name of the link element created from the specified link object.
Return Value
Type: Int32
Returns zero if the link element name is successfully retrieved; otherwise it returns nonzero. An error occurs if the analysis model does not exist.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim Elm As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'create the analysis model
       ret = SapModel.Analyze.CreateAnalysisModel
   'get link element name
       ret = SapModel.LinkObj.GetElm(Name, Elm)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace